import React from 'react';
import styles from './MainPage.module.scss';

export const MainPage = () => {
  return (
    <div className={styles.main}>
      <h1>Роль женщин в Русской Революции 1917 года</h1>
      <p>
        Добро пожаловать на наш сайт, посвященный истории и важной роли, которую женщины сыграли в
        русской революции 1917 года. Этот период русской истории был временем перемен, борьбы за
        равенство и социальную справедливость, и женщины стояли в первых рядах этого движения.
      </p>
      <h2>О женщинах и революции</h2>
      <p>
        Русская революция 1917 года была ключевым моментом в истории России. В тот период женщины
        активно участвовали в социальных преобразованиях и боролись за свои права. Они участвовали в
        демонстрациях, забастовках и других формах гражданской активности, выражая свой протест и
        желание видеть изменения в обществе.
      </p>
      <h2>Их вклад и наследие</h2>
      <p>
        Женщины рисковали жизнями, чтобы выразить свои убеждения и добиться перемен. Их участие в
        революции вдохновило многих и помогло изменить общество. Советский Союз впоследствии признал
        равенство полов, и женщины стали активно участвовать в политике, культуре и других сферах
        жизни.
      </p>
      <h2>Исследование и обсуждение</h2>
      <p>
        На этом сайте мы предоставляем информацию, статьи, видеоматериалы и ресурсы, чтобы помочь
        вам лучше понять историю роли женщин в русской революции 1917 года. Мы приглашаем вас
        углубиться в эту тему, изучить историю и обсудить важность равенства полов в обществе.
        Благодарим вас за посещение нашего сайта, и мы надеемся, что информация, предоставленная
        здесь, будет интересной и полезной. Роль женщин в революции 1917 года оставила глубокий след
        в истории России, и ее значение продолжает вдохновлять нас в наше время.
      </p>
    </div>
  );
};
