export const news = [
  {
    id: 1,
    title: 'О женщинах и революции',
    shortText: 'Русская революция 1917 года была ключевым моментом в истории России. В тот период женщины активно участвовали в социальных преобразованиях и боролись за свои права. Они участвовали в демонстрациях, забастовках и других формах гражданской активности, выражая свой протест и желание видеть изменения в обществе.',
    mainText: 'Русская революция 1917 года – это период, который нельзя переоценить в истории России. Он характеризовался бурными социальными и политическими переменами, и женщины играли в нем ключевую роль. В этот период женщины стали неотъемлемой частью общественных изменений, борясь за свои права и равенство. Активное участие женщин в революционных событиях было вдохновляющим источником перемен. Они не только выходили на улицы и участвовали в демонстрациях, но и принимали участие в забастовках и других формах гражданской активности. Смело выражая свой протест, они высказывали свое стремление к переменам в обществе. Это участие женщин в революции не только помогло добиться отмены царского режима, но и сыграло важную роль в формировании новой, более равноправной России. Их участие продемонстрировало важность гендерного равенства и вдохновило многих на продолжение борьбы за социальную справедливость и права женщин в будущем.',
  },
  {
    id: 2,
    title: 'Их вклад и наследие',
    shortText: 'Женщины рисковали жизнями, чтобы выразить свои убеждения и добиться перемен. Их участие в революции вдохновило многих и помогло изменить общество. Советский Союз впоследствии признал равенство полов, и женщины стали активно участвовать в политике, культуре и других сферах жизни',
    mainText: 'Женщины того времени были готовы пойти на крайние меры, даже рискуя своими жизнями, чтобы выразить свои убеждения и добиться перемен в российском обществе. Их смелость и решимость служили примером многим другим, и это участие в революции оставило незабываемый след в истории. Участие женщин в русской революции не только укрепило борьбу за равенство, но также способствовало глубоким изменениям в обществе. С развалом царской монархии и установлением нового политического порядка, советское правительство впоследствии признало равенство полов как одно из фундаментальных принципов. Это признание открыло двери для женщин, позволив им активно участвовать в политике, культуре и других сферах жизни. Женщины стали занимать ключевые позиции в государственном управлении, а также в образовании и культуре. Они внесли значительный вклад в развитие науки, искусства и образования, оказывая глубокое влияние на культурную и социальную жизнь Советского Союза. Это период также стал временем, когда женщины начали активно участвовать в промышленности и сельском хозяйстве, принимая на себя важные экономические роли. Важно отметить, что наследие женщин, участвовавших в русской революции, продолжает вдохновлять не только Россию, но и весь мир. Их смелость и стремление к равенству стали символом борьбы за справедливость и уважение прав человека. С их участием и настойчивостью родилась новая эра, которая проложила путь к более равноправному и справедливому обществу.',
  },
  {
    id: 3,
    title: 'Исследование и обсуждение',
    shortText: 'На этом сайте мы предоставляем информацию, статьи, видеоматериалы и ресурсы, чтобы помочь вам лучше понять историю роли женщин в русской революции 1917 года. Мы приглашаем вас углубиться в эту тему, изучить историю и обсудить важность равенства полов в обществе. Благодарим вас за посещение нашего сайта, и мы надеемся, что информация, предоставленная здесь, будет интересной и полезной. Роль женщин в революции 1917 года оставила глубокий след в истории России, и ее значение продолжает вдохновлять нас в наше время.',
    mainText: '123',
  },
];
// Блять отсутвие базы данных делают из тебя ублюдка
// detailed information - подобъект для модального окна
